In [1]:
import pandas as pd
data=pd.read_csv("cse1.csv")
data

      NAME  AGE  SALARY
0     Ammu   19   50000
1     Gayu   17   75000
2  Pallavi   45  100000
3    Priya   12   35000
4    Malli   27   40000

In [2]:
print(data)

      NAME  AGE  SALARY
0     Ammu   19   50000
1     Gayu   17   75000
2  Pallavi   45  100000
3    Priya   12   35000
4    Malli   27   40000

In [3]:
data["AGE"]

0    19
1    17
2    45
3    12
4    27
Name: AGE, dtype: int64

In [7]:
data["AGE"]>20

0    False
1    False
2     True
3    False
4     True
Name: AGE, dtype: bool

In [8]:
data[["NAME","SALARY"]]

      NAME  SALARY
0     Ammu   50000
1     Gayu   75000
2  Pallavi  100000
3    Priya   35000
4    Malli   40000

In [9]:
data[["NAME","AGE"]]

      NAME  AGE
0     Ammu   19
1     Gayu   17
2  Pallavi   45
3    Priya   12
4    Malli   27

In [10]:
data["AGE"].max()

45

In [11]:
data["AGE"].min()

12

In [12]:
data["SALARY"].max()

100000

In [13]:
data["SALARY"].min()

35000

In [14]:
data.head(2)

   NAME  AGE  SALARY
0  Ammu   19   50000
1  Gayu   17   75000

In [15]:
data.tail(3)

      NAME  AGE  SALARY
2  Pallavi   45  100000
3    Priya   12   35000
4    Malli   27   40000

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
NAME      5 non-null object
AGE       5 non-null int64
SALARY    5 non-null int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [17]:
data.describe()

             AGE         SALARY
count   5.000000       5.000000
mean   24.000000   60000.000000
std    12.922848   27156.951228
min    12.000000   35000.000000
25%    17.000000   40000.000000
50%    19.000000   50000.000000
75%    27.000000   75000.000000
max    45.000000  100000.000000

In [18]:
data[data["AGE"]>20]

      NAME  AGE  SALARY
2  Pallavi   45  100000
4    Malli   27   40000

In [19]:
type(data)

pandas.core.frame.DataFrame